_real_loadable_dump/Documents/ФинальнаяСправка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ФинальнаяСправка</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
		<Attribute>
			<Properties>
				<Name>Заказ</Name>
				<Type>
					<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
				</Type>
			</Properties>
		</Attribute>
		<Attribute>
			<Properties>
				<Name>Отправка</Name>
				<Type>
					<v8:Type>cfg:DocumentRef.Отправка</v8:Type>
				</Type>
			</Properties>
		</Attribute>
		<Attribute>
			<Properties>
				<Name>ПланСумма</Name>
				<Type>
					<v8:Type>xs:decimal</v8:Type>
					<v8:NumberQualifiers>
						<v8:Digits>15</v8:Digits>
						<v8:FractionDigits>2</v8:FractionDigits>
					</v8:NumberQualifiers>
				</Type>
			</Properties>
		</Attribute>
		<Attribute>
			<Properties>
				<Name>ФактСумма</Name>
				<Type>
					<v8:Type>xs:decimal</v8:Type>
					<v8:NumberQualifiers>
						<v8:Digits>15</v8:Digits>
						<v8:FractionDigits>2</v8:FractionDigits>
					</v8:NumberQualifiers>
				</Type>
			</Properties>
		</Attribute>
		<Attribute>
			<Properties>
				<Name>ОтклонениеСумма</Name>
				<Type>
					<v8:Type>xs:decimal</v8:Type>
					<v8:NumberQualifiers>
						<v8:Digits>15</v8:Digits>
						<v8:FractionDigits>2</v8:FractionDigits>
					</v8:NumberQualifiers>
				</Type>
			</Properties>
		</Attribute>
		<Attribute>
			<Properties>
				<Name>ОтклонениеПроцент</Name>
				<Type>
					<v8:Type>xs:decimal</v8:Type>
					<v8:NumberQualifiers>
						<v8:Digits>9</v8:Digits>
						<v8:FractionDigits>2</v8:FractionDigits>
					</v8:NumberQualifiers>
				</Type>
			</Properties>
		</Attribute>
		<Attribute>
			<Properties>
				<Name>ВаловаяПрибыль</Name>
				<Type>
					<v8:Type>xs:decimal</v8:Type>
					<v8:NumberQualifiers>
						<v8:Digits>15</v8:Digits>
						<v8:FractionDigits>2</v8:FractionDigits>
					</v8:NumberQualifiers>
				</Type>
			</Properties>
		</Attribute>
		<Attribute>
			<Properties>
				<Name>НалогНаПрибыль</Name>
				<Type>
					<v8:Type>xs:decimal</v8:Type>
					<v8:NumberQualifiers>
						<v8:Digits>15</v8:Digits>
						<v8:FractionDigits>2</v8:FractionDigits>
					</v8:NumberQualifiers>
				</Type>
			</Properties>
		</Attribute>
		<Attribute>
			<Properties>
				<Name>ЧистаяПрибыль</Name>
				<Type>
					<v8:Type>xs:decimal</v8:Type>
					<v8:NumberQualifiers>
						<v8:Digits>15</v8:Digits>
						<v8:FractionDigits>2</v8:FractionDigits>
					</v8:NumberQualifiers>
				</Type>
			</Properties>
		</Attribute>
		<Attribute>
			<Properties>
				<Name>МаржаПроцент</Name>
				<Type>
					<v8:Type>xs:decimal</v8:Type>
					<v8:NumberQualifiers>
						<v8:Digits>9</v8:Digits>
						<v8:FractionDigits>2</v8:FractionDigits>
					</v8:NumberQualifiers>
				</Type>
			</Properties>
		</Attribute>
		<Attribute>
			<Properties>
				<Name>Пояснения</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>1000</v8:Length>
					</v8:StringQualifiers>
				</Type>
			</Properties>
		</Attribute>
		<Attribute>
			<Properties>
				<Name>РешениеРуководителя</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>100</v8:Length>
					</v8:StringQualifiers>
				</Type>
			</Properties>
		</Attribute>
		<Attribute>
			<Properties>
				<Name>Утверждено</Name>
				<Type>
					<v8:Type>xs:boolean</v8:Type>
				</Type>
			</Properties>
		</Attribute>
		<Attribute>
			<Properties>
				<Name>ДатаРешения</Name>
				<Type>
					<v8:Type>xs:dateTime</v8:Type>
					<v8:DateQualifiers>
						<v8:DateFractions>Date</v8:DateFractions>
					</v8:DateQualifiers>
				</Type>
			</Properties>
		</Attribute>
		<Attribute>
			<Properties>
				<Name>Комментарий</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>500</v8:Length>
					</v8:StringQualifiers>
				</Type>
			</Properties>
		</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

_real_loadable_dump/Documents/ФинальнаяСправка/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если НЕ ЗначениеЗаполнено(Заказ) Тогда
		Сообщить("Для финальной справки нужно выбрать заказ.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ОбъектЗаказа = Заказ.ПолучитьОбъект();
	ПланСумма = ОбъектЗаказа.СуммаЗаказаРуб;

	ФактСумма = 0;
	Для Каждого СтрокаПозиции Из ОбъектЗаказа.Позиции Цикл
		ФактСумма = ФактСумма + СтрокаПозиции.ИтоговаяСуммаРуб;
	КонецЦикла;

	Если ФактСумма = 0 Тогда
		ФактСумма = ПланСумма;
	КонецЕсли;

	ОтклонениеСумма = ФактСумма - ПланСумма;                      // delta
	ОтклонениеПроцент = ?(ПланСумма = 0, 0, ОтклонениеСумма / ПланСумма * 100); // delta_percent
	ВаловаяПрибыль = ОбъектЗаказа.СуммаМаржиРуб;                  // gross_profit
	НалогНаПрибыль = ?(ВаловаяПрибыль > 0, ВаловаяПрибыль * 0.2, 0); // tax_on_profit
	ЧистаяПрибыль = ВаловаяПрибыль - НалогНаПрибыль;              // net_profit
	МаржаПроцент = ?(ФактСумма = 0, 0, ЧистаяПрибыль / ФактСумма * 100); // margin_%

КонецПроцедуры
